tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Zsh prompt for Astronauts
brew "spaceship"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# Audio utility
cask "background-music"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Quick Look plugin for Kindle ebook formats
cask "qlmobi"
# Open-source code editor
cask "visual-studio-code"
# Input method helper
cask "youtype"
mas "Adblock Plus", id: 1432731683
mas "Be Focused Pro", id: 961632517
mas "Boop", id: 1518425043
mas "Clearview", id: 557090104
mas "Cloud Mail.Ru", id: 893068358
mas "DaisyDisk", id: 411643860
mas "Disk Speed Test", id: 425264550
mas "DjVuReader", id: 492931203
mas "hide.me VPN", id: 953040671
mas "Kindle", id: 405399194
mas "LilyView", id: 529490330
mas "Magnet", id: 441258766
mas "MediaInfo", id: 510620098
mas "Moom", id: 419330170
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Numi", id: 484388250
mas "Pages", id: 409201541
mas "PCalc", id: 403504866
mas "PopClip", id: 445189367
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "Toggl Track", id: 1291898086
mas "Transmit", id: 403388562
mas "Twitter", id: 409789998
mas "Unclutter", id: 577085396
mas "Vpnify", id: 1503251395
mas "WebMoney Keeper", id: 807337125
mas "WhatsApp", id: 1147396723
mas "Yandex.Disk", id: 560459030
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "burkeholland.simple-react-snippets"
vscode "byi8220.indented-block-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dbalas.vscode-html2pug"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "DotJoshJohnson.xml"
vscode "douglaszaltron.nunjucks-vscode-extensionpack"
vscode "ducfilan.pug-formatter"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "ElecTreeFrying.auto-import"
vscode "ElecTreeFrying.drag-import-relative-path"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "humao.rest-client"
vscode "JerryHong.autofilename"
vscode "jock.svg"
vscode "junstyle.php-cs-fixer"
vscode "kvxymatt.class-extractor"
vscode "letrieu.expand-region"
vscode "lior-chamla.google-fonts"
vscode "maptz.camelcasenavigation"
vscode "michelemelluso.code-beautifier"
vscode "miramac.vscode-exec-node"
vscode "mrmlnc.vscode-puglint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.theme-oceanicnext"
vscode "negokaz.live-server-preview"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "riazxrazor.html-to-jsx"
vscode "ritwickdey.LiveServer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "syler.sass-indented"
vscode "techer.open-in-browser"
vscode "tlent.jest-snapshot-language-support"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "vscode-icons-team.vscode-icons"
vscode "wmaurer.change-case"
vscode "wmaurer.vscode-jumpy"
vscode "xabikos.JavaScriptSnippets"
vscode "yuichinukiyama.vscode-preview-server"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
