tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Zsh prompt for Astronauts
brew "spaceship"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
# Quick Look plugin for Kindle ebook formats
cask "qlmobi"
mas "Adblock Plus", id: 1432731683
mas "Be Focused Pro", id: 961632517
mas "Boop", id: 1518425043
mas "Clearview", id: 557090104
mas "Cloud Mail.Ru", id: 893068358
mas "DaisyDisk", id: 411643860
mas "Disk Speed Test", id: 425264550
mas "DjVuReader", id: 492931203
mas "hide.me VPN", id: 953040671
mas "Kindle", id: 405399194
mas "LilyView", id: 529490330
mas "MediaInfo", id: 510620098
mas "Moom", id: 419330170
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Numi", id: 484388250
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "The Unarchiver", id: 425424353
mas "Toggl Track", id: 1291898086
mas "Transmit", id: 403388562
mas "Twitter", id: 409789998
mas "Unclutter", id: 577085396
mas "UnRAR Expander - Zip, Rar Extractor", id: 952944327
mas "Vpnify", id: 1503251395
mas "WebMoney Keeper", id: 807337125
mas "WhatsApp", id: 1147396723
