# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Brews (Packages)
brew "bat"
brew "openldap"
brew "curl"
brew "freetds"
brew "gh"
brew "pcre"
brew "python@3.9"
brew "glib"
brew "httpie"
brew "httrack"
brew "krb5"
brew "libpq"
brew "nghttp2"
brew "node"
brew "nvm"
brew "php", link: false
brew "pnpm"
brew "postgresql@14"
brew "postgresql@9.6"
brew "python@3.10", link: false
brew "tcl-tk"
brew "python@3.8", link: false
brew "redis", restart_service: true
brew "telnet"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "exa"

# Casks (Applications)
cask "alfred"
cask "dbeaver-community"
cask "qlmobi"
cask "dropbox"
